{
  "$Version": "4.0",
  "$Reference": {
    "https://oasis-tcs.github.io/odata-vocabularies/vocabularies/Org.OData.Core.V1.json": {
      "$Include": [{ "$Namespace": "Org.OData.Core.V1", "$Alias": "Core" }]
    },
    "https://oasis-tcs.github.io/odata-vocabularies/vocabularies/Org.OData.Validation.V1.json": {
      "$Include": [{ "$Namespace": "Org.OData.Validation.V1", "$Alias": "Validation" }]
    },
    "https://sap.github.io/odata-vocabularies/vocabularies/Common.json": {
      "$Include": [{ "$Namespace": "com.sap.vocabularies.Common.v1", "$Alias": "Common" }]
    }
  },
  "com.sap.vocabularies.PersonalData.v1": {
    "$Alias": "PersonalData",
    "@Core.Description": "Terms for annotating Personal Data",
    "@Core.Description#Published": "2018-01-24 © Copyright 2018 SAP SE. All rights reserved",
    "@Core.Links": [
      { "rel": "alternate", "href": "https://sap.github.io/odata-vocabularies/vocabularies/PersonalData.xml" },
      { "rel": "latest-version", "href": "https://sap.github.io/odata-vocabularies/vocabularies/PersonalData.json" },
      {
        "rel": "describedby",
        "href": "https://github.com/sap/odata-vocabularies/blob/main/vocabularies/PersonalData.md"
      }
    ],
    "@Core.LongDescription": "\n## Definition\n\nPersonal Data is any information relating to an identified or identifiable natural person (\"data subject\"). \n\nAn identifiable natural person is one who can be identified, directly or indirectly, in particular by reference to an identifier such as a name, an identification number, location data, an online identifier, or to one or more factors specific to the physical, physiological, genetic, mental, economic, cultural, or social identity of that natural person.\n\nPersonal data can only be processed under certain legal grounds, e.g. explicit consent of the data subject or a contractual obligation.\n\nThis vocabulary defines terms specific to the European [General Data Protection Regulation (GDPR)](https://ec.europa.eu/info/law/law-topic/data-protection_en).\n\nTerms for contact and address information are defined in the [Communication vocabulary](Communication.md#).\n\n### References\n- [European Commission: Reform of EU data protection rules](https://ec.europa.eu/info/law/law-topic/data-protection/reform_en)\n- [European Commission: Rules for business and organisations](https://ec.europa.eu/info/law/law-topic/data-protection/reform/rules-business-and-organisations_en)\n- [European Commission: Legal grounds for processing data](https://ec.europa.eu/info/law/law-topic/data-protection/reform/rules-business-and-organisations/legal-grounds-processing-data_en).\n       ",
    "EntitySemantics": {
      "$Kind": "Term",
      "$Type": "PersonalData.EntitySemanticsType",
      "$AppliesTo": ["EntitySet"],
      "@Core.Description": "Primary meaning of the entities in the annotated entity set"
    },
    "DataSubjectRole": {
      "$Kind": "Term",
      "$Nullable": true,
      "$AppliesTo": ["EntitySet"],
      "@Core.Description": "Role of the data subjects in this set (e.g. employee, customer)",
      "@Core.LongDescription": "Values are application-specific.\n          Can be a static value or a `Path` expression If the role varies per entity"
    },
    "DataSubjectRoleDescription": {
      "$Kind": "Term",
      "$Nullable": true,
      "$AppliesTo": ["EntitySet"],
      "@Core.IsLanguageDependent": true,
      "@Core.Description": "Language-dependent description of the role of the data subjects in this set (e.g. employee, customer)",
      "@Core.LongDescription": "Values are application-specific.\n          Can be a static value or a `Path` expression If the role varies per entity"
    },
    "EntitySemanticsType": {
      "$Kind": "TypeDefinition",
      "$UnderlyingType": "Edm.String",
      "@Core.Description": "Primary meaning of the data contained in the annotated entity set",
      "@Validation.AllowedValues": [
        {
          "Value": "DataSubject",
          "@Core.Description": "Entities describing a data subject (an identified or identifiable natural person), e.g. customer, vendor, employee",
          "@Core.LongDescription": "These entities are relevant for audit logging. There are no restrictions on their structure. The properties should be annotated suitably with [FieldSemantics](#FieldSemantics)."
        },
        {
          "Value": "DataSubjectDetails",
          "@Core.Description": "Entities containing details to a data subject (an identified or identifiable natural person) but not representing data subjects by themselves, e.g. street addresses, email addresses, phone numbers",
          "@Core.LongDescription": "These entities are relevant for audit logging. There are no restrictions on their structure. The properties should be annotated suitably with [FieldSemantics](#FieldSemantics)."
        },
        {
          "Value": "Other",
          "@Core.Description": "Entities containing personal data or references to data subjects but not representing data subjects or data subject details by themselves, e.g. customer quote, customer order, purchase order with involved business partners",
          "@Core.LongDescription": "These entities are relevant for audit logging. There are no restrictions on their structure. The properties should be annotated suitably with [FieldSemantics](#FieldSemantics)."
        }
      ]
    },
    "FieldSemantics": {
      "$Kind": "Term",
      "$Type": "PersonalData.FieldSemanticsType",
      "$AppliesTo": ["Property"],
      "@Core.Description": "Primary meaning of the personal data contained in the annotated property",
      "@Core.LongDescription": "Changes to values of annotated properties are tracked in the audit log. Use this annotation also on fields that are already marked as contact or address data."
    },
    "FieldSemanticsType": {
      "$Kind": "TypeDefinition",
      "$UnderlyingType": "Edm.String",
      "@Core.Description": "Primary meaning of a data field",
      "@Validation.AllowedValues": [
        { "Value": "DataSubjectID", "@Core.Description": "The unique identifier for a data subject" },
        {
          "@Common.Experimental": true,
          "Value": "DataSubjectIDType",
          "@Core.Description": "The type of ID identifying the data subject and which is allocated when creating a consent record, e.g. an e-mail address or a phone number."
        },
        {
          "@Common.Experimental": true,
          "Value": "ConsentID",
          "@Core.Description": "The unique identifier for a consent",
          "@Core.LongDescription": "A consent is the action of the data subject confirming that \n                the usage of his or her personal data shall be allowed for a given purpose. \n                A consent functionality allows the storage of a consent record in relation \n                to a specific purpose and shows if a data subject has granted, withdrawn, \n                or denied consent."
        },
        {
          "@Common.Experimental": true,
          "Value": "PurposeID",
          "@Core.Description": "The unique identifier for the purpose of processing of personal data.",
          "@Core.LongDescription": "The unique identifier for the purpose of processing of personal data. Any processing of personal data is based on a specified, explicit, and legitimate purposes and not further processed in a manner that is incompatible with those purposes. The purpose is defined by the data controller or joint data controllers."
        },
        {
          "Value": "ContractRelatedID",
          "@Core.Description": "The unique identifier for transactional data that is related to a contract that requires processing of personal data",
          "@Core.LongDescription": "Examples:\n\n                - Sales Contract ID\n\n                - Purchase Contract ID\n\n                - Service Contract ID\n                "
        },
        {
          "Value": "LegalEntityID",
          "@Core.Description": "The unique identifier of a legal entity",
          "@Core.LongDescription": "A legal entity is a corporation, an association, or any other organization of legal capacity, which has statutory rights and responsibilities.",
          "@Core.Revisions": [
            { "Kind": "Deprecated", "Description": "Deprecated in favor of [`DataControllerID`](#DataControllerID)" }
          ]
        },
        {
          "@Common.Experimental": true,
          "Value": "UserID",
          "@Core.Description": "The unique identifier of a user",
          "@Core.LongDescription": "A user is an individual who interacts with the services supplied by a system."
        },
        {
          "@Common.Experimental": true,
          "Value": "EndOfBusinessDate",
          "@Core.Description": "Defines the end of active business and the start of residence time and retention period",
          "@Core.LongDescription": "End of business is the point in time when the processing of a set of personal data is no longer required for the active business,\n                for example, when a contract is fulfilled. After this has been reached and a customer-defined residence period has passed, the data is blocked and can only be accessed\n                by users with special authorizations (for example, tax auditors).\n                All fields of type `Edm.Date` or `Edm.DateTimeOffset` on which the end of business determination depends should be annotated."
        },
        {
          "@Common.Experimental": true,
          "Value": "DataControllerID",
          "@Core.Description": "The unique identifier of a data controller",
          "@Core.LongDescription": "The unique identifier of a legal entity which alone or jointly with others determines the purposes and means of the processing of personal data. \n                The Data Controller is fully responsible (and accountable) that data protection and privacy principles (such as purpose limitation or data minimization), defined in the European General Data Protection Regulation (GDPR) or any other data protection legislation, are adhered to when processing personal data. The DataControllerID succeeds the LegalEntityID."
        },
        {
          "@Common.Experimental": true,
          "Value": "BlockingDate",
          "@Core.Description": "Defines a date that marks when the provider of the data will block these",
          "@Core.LongDescription": "Defines a date that marks when the provider of the data will block these. This is the point in time when the processing of a set of personal data is no longer required for the active business, for example, when a contract is fulfilled. After it has been reached, the data is blocked in the source and can only be displayed by users with special authorizations (for example, tax auditors); however, it is not allowed to create/change/copy/follow-up blocked data. Consumers of the data should consider if there is an additional purpose to process the data beyond the defined blocking date."
        },
        {
          "@Common.Experimental": true,
          "Value": "EndOfRetentionDate",
          "@Core.Description": "Defines the date when the provider destroys the data",
          "@Core.LongDescription": "Defines a date that marks when the provider of the data can destroy these. Consumers of the data should consider if there is an additional purpose (or a legal hold) to process the data beyond the defined destruction date."
        }
      ]
    },
    "IsPotentiallyPersonal": {
      "$Kind": "Term",
      "$Type": "Core.Tag",
      "$DefaultValue": true,
      "$AppliesTo": ["Property"],
      "@Core.Description": "Property contains potentially personal data",
      "@Core.LongDescription": "Property contains potentially personal data. Personal data describes any information which is related to an identified or identifiable natural person (data subject). An identifiable person is one who can be identified, directly or indirectly, in particular by a reference to an identifier such as a name, an identification number, location data, an online identifier, or to one or more factors specific to the physical, physiological, genetic, mental, economic, cultural, or social identity of that natural person. \n\nNote: properties annotated with [`FieldSemantics`](#FieldSemantics) need not be additionally annotated with this term.\n\n"
    },
    "IsPotentiallySensitive": {
      "$Kind": "Term",
      "$Type": "Core.Tag",
      "$DefaultValue": true,
      "$AppliesTo": ["Property"],
      "@Core.Description": "Property contains potentially sensitive personal data",
      "@Core.LongDescription": "Property contains potentially sensitive personal data. Sensitive personal data is a category of personal data that needs special handling. The determination which personal data is sensitive may differ for different legal areas or industries. Examples of sensitive personal data:\n-  Special categories of personal data, such as data revealing racial or ethnic origin, political opinions, religious or philosophical beliefs, trade union membership, genetic data, biometric data, data concerning health or sex life or sexual orientation.\n-  Personal data subject to professional secrecy.\n-  Personal data relating to criminal or administrative offences.\n-  Personal data concerning insurances and bank or credit card accounts.\n\n"
    }
  }
}
